### Write a Pandas program to create a multi Index frame using two columns and using an Index and a column.

In [1]:
import pandas as pd
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

In [2]:
print(df)

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

### Creating Index Using two columns.

In [5]:
### Set two 'school_code' and 't_id' column as Index.

df1=df.set_index(['school_code','t_id'])
print(df1)

                 class            name date_Of_Birth  weight  address
school_code t_id
s001        t1       V  Alberto Franco    15/05/2002      35  street1
s002        t2       V    Gino Mcneill    17/05/2002      32  street2
s003        t3      VI     Ryan Parkes    16/02/1999      33  street3
s001        t4      VI    Eesha Hinton    25/09/1998      30  street1
s002        t5       V    Gino Mcneill    11/05/2002      31  street2
s004        t6      VI    David Parkes    15/09/1997      32  street4

In [6]:
### Set two 'school_code' and 'class' column as Index.

df2=df.set_index(['school_code','class'])
print(df2)

                             name date_Of_Birth  weight  address t_id
school_code class
s001        V      Alberto Franco    15/05/2002      35  street1   t1
s002        V        Gino Mcneill    17/05/2002      32  street2   t2
s003        VI        Ryan Parkes    16/02/1999      33  street3   t3
s001        VI       Eesha Hinton    25/09/1998      30  street1   t4
s002        V        Gino Mcneill    11/05/2002      31  street2   t5
s004        VI       David Parkes    15/09/1997      32  street4   t6

In [7]:
### Set two 't_id' and 'class' column as Index.

df3=df.set_index(['t_id','class'])
print(df3)

           school_code            name date_Of_Birth  weight  address
t_id class
t1   V            s001  Alberto Franco    15/05/2002      35  street1
t2   V            s002    Gino Mcneill    17/05/2002      32  street2
t3   VI           s003     Ryan Parkes    16/02/1999      33  street3
t4   VI           s001    Eesha Hinton    25/09/1998      30  street1
t5   V            s002    Gino Mcneill    11/05/2002      31  street2
t6   VI           s004    David Parkes    15/09/1997      32  street4

In [10]:
### Set index and 'class' column as Index.

df4=df.set_index([pd.Index([0,1,2,3,4,5]),'class'])
print(df4)

        school_code            name date_Of_Birth  weight  address t_id
  class
0 V            s001  Alberto Franco    15/05/2002      35  street1   t1
1 V            s002    Gino Mcneill    17/05/2002      32  street2   t2
2 VI           s003     Ryan Parkes    16/02/1999      33  street3   t3
3 VI           s001    Eesha Hinton    25/09/1998      30  street1   t4
4 V            s002    Gino Mcneill    11/05/2002      31  street2   t5
5 VI           s004    David Parkes    15/09/1997      32  street4   t6

In [14]:
### Set index and 't_id' column as Index.

df5=df.set_index([pd.Index([10,20,30,40,50,60]),'t_id'])
print(df5)

        school_code class            name date_Of_Birth  weight  address
   t_id
10 t1          s001     V  Alberto Franco    15/05/2002      35  street1
20 t2          s002     V    Gino Mcneill    17/05/2002      32  street2
30 t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
40 t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
50 t5          s002     V    Gino Mcneill    11/05/2002      31  street2
60 t6          s004    VI    David Parkes    15/09/1997      32  street4

In [15]:
### Show default Index.

print(df.head(10))

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [20]:
### Reset the Index.

df1_r=df1.reset_index(inplace=False)
print(df1_r)
print(" ")

df2_r=df.reset_index(inplace=False)
print(df2_r)
print(" ")

df3_r=df.reset_index(inplace=False)
print(df3_r)
print(" ")

df4_r=df.reset_index(inplace=False)
print(df4_r)
print(" ")

df5_r=df.reset_index(inplace=False)
print(df5_r)
print(" ")

  school_code t_id class            name date_Of_Birth  weight  address
0        s001   t1     V  Alberto Franco    15/05/2002      35  street1
1        s002   t2     V    Gino Mcneill    17/05/2002      32  street2
2        s003   t3    VI     Ryan Parkes    16/02/1999      33  street3
3        s001   t4    VI    Eesha Hinton    25/09/1998      30  street1
4        s002   t5     V    Gino Mcneill    11/05/2002      31  street2
5        s004   t6    VI    David Parkes    15/09/1997      32  street4

   index school_code class            name date_Of_Birth  weight  address t_id
0      0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1      1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2      2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3      3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4      4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5      5        s004    VI    David Parkes    15/09/1997      32  street4   t6

   index school_code class            name date_Of_Birth  weight  address t_id
0      0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1      1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2      2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3      3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4      4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5      5        s004    VI    David Parkes    15/09/1997      32  street4   t6

   index school_code class            name date_Of_Birth  weight  address t_id
0      0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1      1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2      2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3      3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4      4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5      5        s004    VI    David Parkes    15/09/1997      32  street4   t6

   index school_code class            name date_Of_Birth  weight  address t_id
0      0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1      1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2      2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3      3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4      4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5      5        s004    VI    David Parkes    15/09/1997      32  street4   t6